/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tterribi <tterribi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/24 16:52:50 by tterribi          #+#    #+#             */
/*   Updated: 2022/11/05 11:12:24 by tterribi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../incl/minishell.h"

void	fancy_init(void)
{
	printf ("\033[0;36m");
	printf("\t███╗   ███╗██╗███╗   ██╗██╗███████╗██╗  ██╗███████╗██╗     ██╗\n"
		"\t████╗ ████║██║████╗  ██║██║██╔════╝██║  ██║██╔════╝██║     ██║\n"
		"\t██╔████╔██║██║██╔██╗ ██║██║███████╗███████║█████╗  ██║     ██║\n"
		"\t██║╚██╔╝██║██║██║╚██╗██║██║╚════██║██╔══██║██╔══╝  ██║     ██║\n"
		"\t██║ ╚═╝ ██║██║██║ ╚████║██║███████║██║  ██║███████╗███████╗███████╗\n"
		"\t╚═╝     ╚═╝╚═╝╚═╝  ╚═══╝╚═╝╚══════╝╚═╝  ╚═╝╚══════╝╚══════╝"
		"╚══════╝\n");
	printf("\033[0m\n");
	printf("\033[0;35m");
//	printf("\t\t    |̵̛̛̛̔͂̽̍̃͂͂̈́͒̂̈́̒̀̎̆̆̀͂͆͆͌̑̐̍͊́̈́̓͑̑̀̋͛̈́̓̏̀̔̏̂̈́̋̀̉͛̿͌̿̌̑͊́̎̅͆̾̏̓̀͒̑͊̅̈̈́̓̿̄̃̒̋̈͗̽͗͊̚͘̚͝͝͠͠͝͠|̷̜̲̤̩̖̒̾̋̇͘͠H̸͓̞̳̜̏ͅo̸̞̰͌̈́̌̀̂́͒͑͠p̷͓͋ȇ̵̹͙̟̠̰͗͐͌̐͝f̸͈͆̆̽̈͋̂̆u̷̹̼̐͌̈̕l̸̡̧͙̞̮̭͉̊͌̏͐͝l̵̫̩̤͇̤̮̓ỳ̸̹̩̪̖͖ ̷̨̨̼̜̈̿̈́́͝͝ą̴̆̂̀̎̃s̴̡̧̧̞͚͈͓̝̬͛̀̉̾̈̾͂̃̕ ̷̧̛̛̣̯̪͉͌́͒̔͠b̵̳̠̥̹͍̞͉̳̚͜͝e̴̢̨͎̖̙̟̺̪̍́͝á̶̛͈̖͔̘̼̮̬̈́͑͑͗̅͑ͅu̸̩͋̾̈̈́̐͑̚͜͝t̴͈̫͔̬͂́̓̽͐̚̚i̵͕̘̲̰̖̓̎̓f̵̡͉̙̟̃̊̔̂̕u̸͉͕͆͗̉̒̈́̓͐l̶̤̝̙̪̱͕̞̩͒̐̽͐̽̔͛̽͘ͅ ̷̳͚̣͓͓̞͔͙̂̔̀́͊ã̷̗̘̰̯͈͙̘̤̫̅̓͛͝͝s̷̯͍̊͝ ̶̬͚̠̞̈́̿̇̈ā̵̬̮̥̄͆̎̈̈́̇́͜͝ ̵̗̝̝̻͈́͂̾̈̉̇͐́͘s̵̛̗̪̣͊͒̓̍̀ḧ̶̰̜̝͙̥͚̺́̓̃͜ě̸͚̀̀̌̄̊̉͒l̷̡̛̪̠̥͖͋͌l̵̡̦͇̪̝͖̎͜ ̷̧͖̭̱̰̞̭̰͋͌͌̉̀̚ͅT̸̗͎̗̓̊̄͑͘.̷͍͙̹̩͓͓̟̇T̶̨̥̬̪͓͎̈́̏̈́͑̚̚|̸̢̢̨̖̪̑̐́͑́͠\n");
	printf("\t\t    |Hopefully as beautiful as a shell T.T|\n");
	printf("\033[0m\n");
}

int	main(int argc, char **argv, char **envp)
{
	int		exit = 0;
	char	*buff;
	int i = 0;
	struct s_env	*env_head = NULL;
	t_main	main;

	fancy_init();
	main.env_head = NULL;
	copy_env(&main.env_head, envp);
	while (exit != 1)
	{
		buff = readline("Minishell> ");
		if (!buff)
			return (printf("\nMinishell> exit\n"));
		add_history(buff);
		parse(buff, &main);
		if (ft_strcmp(buff, "luce") == 0)
			printf("DVCE\n");
		else
			printf("%s\n", buff);
		rl_redisplay();
	}
}
